#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app.aws_cloudfront_cache_policy.frontend_bucket will be created
  + resource "aws_cloudfront_cache_policy" "frontend_bucket" {
      + comment     = "Default policy when CF compression is enabled"
      + default_ttl = 86400
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 31536000
      + min_ttl     = 1
      + name        = "Managed-CachingOptimized"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "none"
            }

          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # module.app.aws_cloudfront_distribution.s3_front_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_front_distribution" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "[MAIN]しおりちゃんカット予約フォーム"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_200"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = (known after apply)
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = (known after apply)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.app.aws_cloudfront_origin_access_control.frontend_bucket will be created
  + resource "aws_cloudfront_origin_access_control" "frontend_bucket" {
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = (known after apply)
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.app.aws_s3_bucket.frontend_bucket will be created
  + resource "aws_s3_bucket" "frontend_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "sio-salon-cut-reserve-main"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_cloudfront_cache_policy = {
      + comment                                         = "Default policy when CF compression is enabled"
      + default_ttl                                     = 86400
      + etag                                            = (known after apply)
      + id                                              = (known after apply)
      + max_ttl                                         = 31536000
      + min_ttl                                         = 1
      + name                                            = "Managed-CachingOptimized"
      + parameters_in_cache_key_and_forwarded_to_origin = [
          + {
              + cookies_config                = [
                  + {
                      + cookie_behavior = "none"
                      + cookies         = []
                    },
                ]
              + enable_accept_encoding_brotli = true
              + enable_accept_encoding_gzip   = true
              + headers_config                = [
                  + {
                      + header_behavior = "none"
                      + headers         = []
                    },
                ]
              + query_strings_config          = [
                  + {
                      + query_string_behavior = "none"
                      + query_strings         = []
                    },
                ]
            },
        ]
    }
  + aws_cloudfront_distribution = {
      + aliases                        = null
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "[MAIN]しおりちゃんカット予約フォーム"
      + custom_error_response          = []
      + default_cache_behavior         = [
          + {
              + allowed_methods             = [
                  + "GET",
                  + "HEAD",
                ]
              + cache_policy_id             = (known after apply)
              + cached_methods              = [
                  + "GET",
                  + "HEAD",
                ]
              + compress                    = true
              + default_ttl                 = (known after apply)
              + field_level_encryption_id   = null
              + forwarded_values            = []
              + function_association        = []
              + lambda_function_association = []
              + max_ttl                     = (known after apply)
              + min_ttl                     = 0
              + origin_request_policy_id    = null
              + realtime_log_config_arn     = null
              + response_headers_policy_id  = null
              + smooth_streaming            = null
              + target_origin_id            = (known after apply)
              + trusted_key_groups          = (known after apply)
              + trusted_signers             = (known after apply)
              + viewer_protocol_policy      = "allow-all"
            },
        ]
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + logging_config                 = []
      + ordered_cache_behavior         = []
      + origin                         = [
          + {
              + connection_attempts      = 3
              + connection_timeout       = 10
              + custom_header            = []
              + custom_origin_config     = []
              + domain_name              = (known after apply)
              + origin_access_control_id = (known after apply)
              + origin_id                = (known after apply)
              + origin_path              = ""
              + origin_shield            = []
              + s3_origin_config         = []
            },
        ]
      + origin_group                   = []
      + price_class                    = "PriceClass_200"
      + restrictions                   = [
          + {
              + geo_restriction = [
                  + {
                      + locations        = (known after apply)
                      + restriction_type = "none"
                    },
                ]
            },
        ]
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = null
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + viewer_certificate             = [
          + {
              + acm_certificate_arn            = null
              + cloudfront_default_certificate = true
              + iam_certificate_id             = null
              + minimum_protocol_version       = "TLSv1"
              + ssl_support_method             = null
            },
        ]
      + wait_for_deployment            = true
      + web_acl_id                     = null
    }
  + aws_s3_bucket               = {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "sio-salon-cut-reserve-main"
      + bucket_domain_name                   = (known after apply)
      + bucket_prefix                        = null
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + object_lock_configuration            = (known after apply)
      + object_lock_enabled                  = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = null
      + tags_all                             = (known after apply)
      + timeouts                             = null
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @YutaCurry, Action: `push`, Working Directory: `bin/main`, Workflow: `create PR by github-actions[bot]`*